CaseLabGreenatom/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.Закупки</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЗаказ</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Позиции</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

CaseLabGreenatom/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемУпаковки</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ингредиенты</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

CaseLabGreenatom/src/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозиции

&НаКлиенте
Процедура ПозицииНоменклатураПриИзменении(Элемент)
	
	ПриИзмененииНоменклатуры(Элементы.Позиции.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЦенаПриИзменении(Элемент)
	
	ПриИзмененииЦены(Элементы.Позиции.ТекущиеДанные);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПозицииКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Позиции.ТекущиеДанные;
	
	ПриИзмененииКоличества(ТекущаяСтрока);
	
	Если ТекущаяСтрока.Количество > 0 Тогда
		
		ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество;
		
	Иначе
		
		ТекущаяСтрока.Цена = 0;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Позиции.ТекущиеДанные;
	
	ПриИзмененииСуммы(ТекущаяСтрока);
	
	Если ТекущаяСтрока.Количество > 0 Тогда
		
		ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество;
		
	Иначе
		
		ТекущаяСтрока.Цена = 0;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииСтавкаНДСПриИзменении(Элемент)
	
	ПриИзмененииСтавкиНДС(Элементы.Позиции.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)

    Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда  //Нужно переделать на подтягивание цен из заказа поставщику
		
		Цена = ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, КонецДня(Объект.Дата));
		ИзмененнаяСтрока.Цена = Цена;
				  	
		Номенклатура = ИзмененнаяСтрока.Номенклатура;		
		СтавкаНДС = СтавкаНДС(Номенклатура);
        ИзмененнаяСтрока.СтавкаНДС = СтавкаНДС;
		
	Иначе
				
		Возврат;
		
	КонецЕсли;
	
	ПриИзмененииЦены(ИзмененнаяСтрока);
	ПриИзмененииСтавкиНДС(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаСервере
Функция СтавкаНДС(Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = 
					"ВЫБРАТЬ
					|	Номенклатура.СтавкаНДС КАК СтавкаНДС
					|ИЗ
					|	Справочник.Номенклатура КАК Номенклатура
					|ГДЕ
					|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Возврат ВыборкаДетальныеЗаписи.СтавкаНДС;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииКоличества(ИзмененнаяСтрока)
	
	Если Не ЗначениеЗаполнено(ИзмененнаяСтрока.Цена) Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	ПересчетКоличестваИСуммы(ИзмененнаяСтрока);
	ПриИзмененииСуммы(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЦены(ИзмененнаяСтрока)
	
	ПересчетКоличестваИСуммы(ИзмененнаяСтрока);
	ПриИзмененииСуммы(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетКоличестваИСуммы(ИзмененнаяСтрока)
	
	Если ИзмененнаяСтрока = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Количество * ИзмененнаяСтрока.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСуммы(ИзмененнаяСтрока)
	
	Если ИзмененнаяСтрока = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИзмененнаяСтрока.Количество) Или Не ЗначениеЗаполнено(ИзмененнаяСтрока.Цена) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИзмененнаяСтрока.СуммаНДС = НДСКлиент.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);	
	ИзмененнаяСтрока.СуммаСНДС = ИзмененнаяСтрока.Сумма + ИзмененнаяСтрока.СуммаНДС;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииСтавкиНДС(ИзмененнаяСтрока)
	
	Если Не ЗначениеЗаполнено(ИзмененнаяСтрока.Сумма) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИзмененнаяСтрока.СуммаНДС = НДСКлиент.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	ИзмененнаяСтрока.СуммаСНДС = ИзмененнаяСтрока.Сумма + ИзмененнаяСтрока.СуммаНДС;
	
КонецПроцедуры

#КонецОбласти
